"use strict"
/*
Задача 0. Обчислити значення виразів
S1=a+12+b
S2=a+b2a 
S3=3(a+b)c 
S4=sin⁡(a-b) 
Задача 1. Знайти суму, добуток та частку двох дійсних чисел. Результат вивести у формі таблиці
Задача 2. Дано рік народження (дата: 1 січня) та поточний рік. Знайти кількість років.
Задача 3. Дано вартість одиниці товару і кількість. Знайти загальну вартість та ПДВ (5% від загальної вартості).
Задача 4. Дано довжину у сантиметрах. Визначати скільки це метрів і кілометрів.
Задача 5. Дано кількість секунд, що пройшла від початку доби. Визначити скільки це годин і хвилин.
Задача 6. З клавіатури вводяться вартість товару та кількість одиниць 3 товарів. Обчислити вартість кожного товару окремо та загальну вартість. Вивести чек (як у супермаркеті) використовуючи елементи розмітки.
Задача 7. Знайти суму випадкового номера місяця (від 1 до 12) та випадкового номера дня (від 0 до 6).
*/

//---- Задача 0/1 ---- 
// S1=a+12+b
/*
const a = parseInt(prompt(`Введіть значення для а`, `0`))
const b = parseInt(prompt(`Введіть значення для b`, `0`))

let S1 = a + 12 + b
document.write(`Значення виразу S1=a+12+b складає: ${S1}`)
*/


//---- Задача 0/2 ---- 
//S2=a+b2a 
/*
const a = parseInt(prompt(`Введіть значення для а`, `0`))
const b = parseInt(prompt(`Введіть значення для b`, `0`))

let S2 = a + b * 2 * a
document.write(`Значення виразу S2=a+b2a складає: ${S2}`)
*/

//---- Задача 0/3 ---- 
// S3=3(a+b)c 
/*
const a = parseInt(prompt(`Введіть значення для а`, `0`))
const b = parseInt(prompt(`Введіть значення для b`, `0`))
const c = parseInt(prompt(`Введіть значення для c`, `0`))

let S3= 3 * (a+b) * c 
document.write(`Значення виразу S3=3*(a+b)*c складає: ${S3}`)
*/


//---- Задача 0/4 ---- 
// S4=sin⁡(a-b) 
/*
const a = parseInt(prompt(`Введіть значення для а`, `0`))
const b = parseInt(prompt(`Введіть значення для b`, `0`))

let S4 = Math.sin(a - b)
document.write(`Значення виразу S4=sin(a-b) складає: ${S4}`)
*/



//---- Задача 1 ---- 
//Задача 1. Знайти суму, добуток та частку двох дійсних чисел. Результат вивести у формі таблиці
/*
const a = parseFloat(prompt(`Введіть значення для "а"`, `0`))
const b = parseFloat(prompt(`Введіть значення для "b"`, `0`))

const sum = a + b
const product = a * b
const quotient = a / b

document.write(`
			<table border="2px">
				<tr>
					<th>Отримане значення a=${a}</th>
					<th>Отримане значення b=${b}</th>
				</tr>
				<tr>
					<th>Шукаємо</th>
					<th>Результат</th>
				</tr>
				<tr>
					<th>Суму a + b</th>
					<td>${sum}</td>
				</tr>
				<tr>
					<th>Добуток a * b</th>
					<td>${product}</td>
				</tr>
				<tr>
					<th>Частку a / b</th>
					<td>${quotient}</td>
				</tr>
			</table>
	`)
*/

//---- Задача 2 ----
//Дано рік народження (дата: 1 січня) та поточний рік. Знайти кількість років.
/*
const userYear = parseInt(prompt('Введіть рік народження', '0'))

let currentDate  = new Date()
let currentYear = currentDate.getFullYear ()

let userAge =  currentYear - userYear

document.write(`Ваш вік = ${userAge}`)

*/

//---- Задача 3 ----
//Дано вартість одиниці товару і кількість. Знайти загальну вартість та ПДВ (5% від загальної вартості).