"use strict"
/*
1. З клавіатури вводяться імена двох дітей та кількість у них цукерок. Вивести не екран ім’я тієї дитини, у якої кількість цукерок є більшою, або вивести, що кількість однакова.

2. З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн.

3. Випадковим чином генерується число від 1 до 5. Спробуйте вгадати число за 2 спроби.

4. З клавіатури вводиться вік людини. Вивести на екран ким він є (дитиною у садочку, школярем, студентом, працівником, пенсіонером).

5. З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). Вивести на екран назву транспортного засобу, яким він може керувати.

6. З клавіатури вводиться номер дня тижня. Вивести на екран назву дня.

7. З клавіатури вводиться номер місяця. Вивести до якої пори він відноситься

//********************************************************* */
//ДЗ_3_Додаткові_Розгалудження:
/*
8.
Задача 1. На екран виводиться меню:
1. Веселий
2. Сумний
3. Обурений
Користувач вводить номер пункту меню і на екрані з’являється відповідне зображення смайла. 

9.
Задача 2. Комп’ютер випадковим чином вибирає початок і кінець проміжку (проміжок повинен знаходитися в межах від 1 до 100). Користувач вводить число і виграє, якщо число знаходиться у цьому проміжку, або розташоване від нього (від лівого або правого краю) не більше ніж на 10.

10.
Задача 3. Комп’ютер загадує число від 1 до 10. Двоє користувачів надають свої відповіді. Виграє той, у кого число знаходиться ближче до загаданого комп’ютером числа.

*/
